
rules = "✅Цель<br>"
rules += "Набрать 21 очко (или быть ближе) и победить дилера<br>"
rules += "<br>🔍Правила<br>"
rules +="<br>▪I этап. Регистрация<br>"
rules +="Для начала игры тебе необходимо сесть за стол и стать участником.<br>"
rules +="❗ Обратите внимание, что закрыть регистрацию можно либо по кнопке, либо регистрация автоматически завершится при наборе 5 игроков.<br>"
rules +="❗❗Игроки, баланс которых ноль или ниже, также не могут присоединиться к матчу.<br>"

rules +="<br>▪II этап. Ставки<br>"
rules +="После этого следует фаза ставок. Игроки делают ставки по очереди, размер ставки зафиксирован и составляет 25%, 50%, 75%, либо 100% от размера банка игрока.<br>"
rules +="❗ Узнать размер своего банка можно, нажав кнопку моя статистика<br>"

rules +="<br>▪III этап. Игра<br>"
rules +="После того как все игроки сделают ставки следует фаза игры самой игры."
rules +="Всем игрокам будет роздано по 2 карты, а дилеру будет роздана 1 карта. Игроки делают ходы по очереди.<br>"
rules +="В свой ход игрок может либо добрать карты по одной до перебора, либо завершить ход.<br>"
rules +="После того как все игроки завершат ход, ходит дилер. Далее карты каждого игрока будут сравнены с картами дилера и будут подведены итоги матча.<br>"

rules +="➡После этого можно начинать регистрацию на новый матч<br>"

rules +="🍀Удачи!🍀"